       IDENTIFICATION DIVISION.             
       PROGRAM-ID.                     HOLA.
       AUTHOR.                         AYMARA M FUSARO.
       DATE-WRITTEN.                   7/11/2021.
       ENVIRONMENT DIVISION.                
       DATA DIVISION.                       
       PROCEDURE DIVISION.                  
           DISPLAY 'HOLA, MUNDO'.           
           STOP RUN. 